XCiscoding/Tracking-Car-Base-On-MSPM0G3507/keil/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000


/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);

/* I2C_OLED: I2C0, SDA=PA0, SCL=PA1 */
#define I2C_OLED_INST                                                       (I2C0)
#define I2C_OLED_BUS_SPEED_HZ                                            (100000)
#define I2C_OLED_IOMUX_SDA                                         (IOMUX_PINCM1)
#define I2C_OLED_IOMUX_SCL                                         (IOMUX_PINCM2)
#define I2C_OLED_IOMUX_SDA_FUNC                           IOMUX_PINCM1_PF_I2C0_SDA
#define I2C_OLED_IOMUX_SCL_FUNC                           IOMUX_PINCM2_PF_I2C0_SCL


/* Port definition for Pin Group GPIO_LED */
#define GPIO_LED_PORT                                                    (GPIOA)

/* Defines for PA7: GPIOA.7 with pinCMx 14 on package pin 49 */
#define GPIO_LED_PA7_PIN                                         (DL_GPIO_PIN_7)
#define GPIO_LED_PA7_IOMUX                                       (IOMUX_PINCM14)

/* ======== LEFT MOTOR (单轮测试) ========
 * Direction: AIN1=PA13(PINCM35), AIN2=PA14(PINCM36), both GPIOA output
 * PWM:       PA8(PINCM19) -> TIMA0 CC0, period=1000, duty 0~1000
 */
#define PWM_LEFT_INST                                                    (TIMA0)
#define PWM_LEFT_IOMUX                                          (IOMUX_PINCM19)
#define PWM_LEFT_IOMUX_FUNC                          IOMUX_PINCM19_PF_TIMA0_CCP0
#define PWM_LEFT_IDX                                     (DL_TIMER_CC_0_INDEX)

#define MOTOR_AIN1_PORT                                                  (GPIOA)
#define MOTOR_AIN1_PIN_0_PIN                                (DL_GPIO_PIN_13)
#define MOTOR_AIN1_IOMUX                                        (IOMUX_PINCM35)

#define MOTOR_AIN2_PORT                                                  (GPIOA)
#define MOTOR_AIN2_PIN_1_PIN                                (DL_GPIO_PIN_14)
#define MOTOR_AIN2_IOMUX                                        (IOMUX_PINCM36)

void SYSCFG_DL_PWM_LEFT_init(void);
void SYSCFG_DL_PWM_RIGHT_init(void);

/* ======== RIGHT MOTOR (双轮阶段实装) ========
 * PWM:       PA24(PINCM54) -> TIMA1 CC1
 * Direction: BIN1=PA16(PINCM38), BIN2=PA17(PINCM39), both GPIOA output
 */
#define PWM_RIGHT_INST                                                   (TIMA1)
#define PWM_RIGHT_IOMUX                                         (IOMUX_PINCM54)
#define PWM_RIGHT_IOMUX_FUNC                         IOMUX_PINCM54_PF_TIMA1_CCP1
#define PWM_RIGHT_IDX                                    (DL_TIMER_CC_1_INDEX)

#define MOTOR_BIN1_PORT                                                  (GPIOA)
#define MOTOR_BIN1_PIN_2_PIN                                (DL_GPIO_PIN_16)
#define MOTOR_BIN1_IOMUX                                        (IOMUX_PINCM38)
#define MOTOR_BIN2_PORT                                                  (GPIOA)
#define MOTOR_BIN2_PIN_3_PIN                                (DL_GPIO_PIN_17)
#define MOTOR_BIN2_IOMUX                                        (IOMUX_PINCM39)

/* ======== ENCODER (占位，后续阶段实装) ========
 * PA12(PINCM34) -> TIMG0 CCP0, edge-count mode
 */
#define QEI_LEFT_INST                                                    (TIMG0)

void SYSCFG_DL_I2C_OLED_init(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
